Repository: zviratko/omlx
Catalog: apps/omlx-mac/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# bench.throughput.header.subtitle
source: Single-request TTFT/TPOT + continuous-batching TPS, swept across context lengths and batch sizes. Results stay in memory until the screen unloads.
ru: TTFT/TPOT для одиночных запросов и TPS непрерывного batching с перебором длин контекста и размеров батча. Результаты остаются в памяти, пока экран не выгружен.
zh_hans: 单请求 TTFT/TPOT + 连续批处理 TPS，跨上下文长度和批次大小扫描。结果保留在内存中，直到屏幕卸载。

# bench.throughput.header.title
source: Measure inference speed
ru: Измерить скорость инференса
zh_hans: 测量推理速度

# bench.throughput.model.placeholder
source: Select a model…
ru: Выберите модель…
zh_hans: 选择模型…

# bench.throughput.progress.running
source: Running… results so far: %lld
ru: Выполняется… результатов пока: %lld
zh_hans: 运行中… 目前结果：%lld

# bench.throughput.progress.warming_up
source: Warming up…
ru: Прогрев…
zh_hans: 预热中…

# bench.throughput.row.batch_sizes.sub
source: Concurrent requests per batch in the continuous-batching phase
ru: Одновременные запросы на батч на этапе continuous batching
zh_hans: 连续批处理阶段中每批次的并发请求数

# bench.throughput.row.batch_sizes.title
source: Batch sizes
ru: Размеры батча
zh_hans: 批次大小

# bench.throughput.row.context_lengths.sub
source: Prompt tokens to feed for each single-request trial
ru: Токены промпта для каждого одиночного прогона
zh_hans: 每次单请求试验要输入的提示 Token 数

# bench.throughput.row.context_lengths.title
source: Context lengths
ru: Длины контекста
zh_hans: 上下文长度

# bench.throughput.row.gen_length.label
source: Generation length
ru: Длина генерации
zh_hans: 生成长度

# bench.throughput.row.gen_length.sub
source: Output tokens per single-request trial
ru: Выходные токены на одиночный прогон
zh_hans: 每次单请求试验的输出 Token 数

# bench.throughput.row.model.label
source: Model
ru: Модель
zh_hans: 模型

# bench.throughput.row.model.sub
source: Loaded or unloaded — server will load on demand
ru: Загружена или нет — сервер загрузит по требованию
zh_hans: 已加载或未加载 — 服务器将按需加载

# bench.throughput.section.batch_results
source: Batch Results
ru: Результаты батчей
zh_hans: 批次结果

# bench.throughput.section.configuration
source: Configuration
ru: Конфигурация
zh_hans: 配置

# bench.throughput.section.leaderboard
source: Community Leaderboard
ru: Лидерборд сообщества
zh_hans: 社区排行榜

# bench.throughput.section.single_results
source: Single Request Results
ru: Результаты одиночных запросов
zh_hans: 单请求结果

# bench.throughput.single.col.e2e
source: E2E (s)
ru: E2E (с)
zh_hans: 端到端 (s)

# bench.throughput.single.col.peak_mem
source: Peak Mem
ru: Пик памяти
zh_hans: 峰值内存

# bench.throughput.single.col.test
source: Test
ru: Тест
zh_hans: 测试

# bench.throughput.single.col.throughput
source: Throughput
ru: Пропускная способность
zh_hans: 吞吐量

# bench.throughput.single.subtitle
source: Trials: %lld
ru: Прогонов: %lld
zh_hans: 试验：%lld

# bench.throughput.subtitle.loading_models
source: Loading models…
ru: Загрузка моделей…
zh_hans: 加载模型中…

# bench.throughput.subtitle.model_count
source: Models available: %lld
ru: Доступно моделей: %lld
zh_hans: 可用模型：%lld

# bench.throughput.text_export.title
source: Text export
ru: Текстовый экспорт
zh_hans: 文本导出

# bench.throughput.upload.count_submitted
source: %lld submitted
ru: %lld отправлено
zh_hans: 已提交 %lld 个

# bench.throughput.upload.owner_hash.label
source: Owner hash
ru: Хэш владельца
zh_hans: 所有者哈希

# bench.throughput.upload.row.already
source: Already submitted
ru: Уже отправлено
zh_hans: 已提交

# bench.throughput.upload.row.no_url
source: No URL returned
ru: URL не получен
zh_hans: 未返回 URL

# bench.throughput.upload.row.submitted
source: Submitted
ru: Отправлено
zh_hans: 已提交

# bench.throughput.upload.skipped.default
source: The server skipped uploading these results.
ru: Сервер пропустил загрузку этих результатов.
zh_hans: 服务器跳过了上传这些结果。

# bench.throughput.upload.skipped.title
source: Skipped community upload
ru: Загрузка в сообщество пропущена
zh_hans: 已跳过社区上传

# bench.throughput.upload.subtitle.done_all
source: %1$lld of %2$lld submitted
ru: Отправлено %1$lld из %2$lld
zh_hans: %1$lld / %2$lld 已提交

# bench.throughput.upload.subtitle.done_partial
source: %1$lld ok · %2$lld failed
ru: %1$lld успешно · %2$lld с ошибкой
zh_hans: %1$lld 成功 · %2$lld 失败

# bench.throughput.upload.subtitle.skipped
source: Skipped
ru: Пропущено
zh_hans: 已跳过

# bench.throughput.upload.subtitle.uploading
source: Submitting results…
ru: Отправка результатов…
zh_hans: 提交结果中…

# bench.throughput.upload.uploading
source: Uploading to omlx.ai…
ru: Загрузка на omlx.ai…
zh_hans: 上传到 omlx.ai 中…

source: Click to copy
ru: Нажмите, чтобы скопировать
zh_hans: 点击复制

source: Close Window
ru: Закрыть окно
zh_hans: 关闭窗口

# bench.throughput.config.pending_flags
source: This run will be tagged on the leaderboard: %@
ru: Этот запуск будет отмечен в таблице лидеров: %@
zh_hans: 此运行将在排行榜上标记：%@

# bench.throughput.upload.flags.title
source: Acceleration flags
ru: Флаги ускорения
zh_hans: 加速标志

# bench.throughput.upload.skipped.external
source: External endpoint results are not submitted because they measure remote hardware.
ru: Результаты внешнего эндпоинта не отправляются, так как измеряют удалённое оборудование.
zh_hans: 外部端点结果不会提交，因为它们测量的是远程硬件。

# bench.throughput.upload.subtitle.done_flagged
source: %1$lld of %2$lld submitted · %3$lld flags
ru: Отправлено %1$lld из %2$lld · флагов: %3$lld
zh_hans: %1$lld / %2$lld 已提交 · %3$lld 个标志

# common.back
source: Back
ru: Назад
zh_hans: 返回

# common.copy
source: Copy
ru: Копировать
zh_hans: 复制

# common.copy_model_id
source: Copy model ID
ru: Скопировать ID модели
zh_hans: 复制模型 ID

# common.create
source: Create
ru: Создать
zh_hans: 创建

# common.open
source: Open
ru: Открыть
zh_hans: 打开

# common.save
source: Save
ru: Сохранить
zh_hans: 保存

# downloads.active.subtitle.empty
source: No active tasks
ru: Нет активных задач
zh_hans: 无活动任务

# downloads.active.subtitle.running
source: %lld running
ru: %lld выполняется
zh_hans: %lld 个正在运行

# downloads.active.title
source: Active Downloads
ru: Активные загрузки
zh_hans: 活动下载

# downloads.button.download
source: Download
ru: Скачать
zh_hans: 下载

# downloads.button.retry
source: Retry
ru: Повторить
zh_hans: 重试

# downloads.button.show_card
source: View model card
ru: Открыть карточку модели
zh_hans: 查看模型卡片

# downloads.cancel.help
source: Cancel
ru: Отменить
zh_hans: 取消

# downloads.card.close
source: Close
ru: Закрыть
zh_hans: 关闭

# downloads.card.download
source: Download
ru: Скачать
zh_hans: 下载

# downloads.card.empty
source: This model doesn't ship a README.
ru: У этой модели нет README.
zh_hans: 此模型未提供 README。

# downloads.card.error
source: Couldn't load model card
ru: Не удалось загрузить карточку модели
zh_hans: 无法加载模型卡片

# downloads.card.files.empty
source: No files reported.
ru: Файлы не указаны.
zh_hans: 无文件报告。

# downloads.card.loading
source: Loading model card…
ru: Загрузка карточки модели…
zh_hans: 正在加载模型卡片…

# downloads.card.lora_warning
source: This is a LoRA adapter. It needs a compatible base model to run — downloading on its own won't load in oMLX.
ru: Это LoRA-адаптер. Для запуска нужна совместимая базовая модель — сам по себе он не загрузится в oMLX.
zh_hans: 这是一个 LoRA 适配器。它需要兼容的基座模型才能运行 — 单独下载无法在 oMLX 中加载。

# downloads.card.retry
source: Retry
ru: Повторить
zh_hans: 重试

# downloads.card.tab.card
source: Model Card
ru: Карточка модели
zh_hans: 模型卡片

# downloads.card.tab.files
source: Files
ru: Файлы
zh_hans: 文件

# downloads.card.tab.tags
source: Tags
ru: Теги
zh_hans: 标签

# downloads.card.tags.empty
source: No tags.
ru: Нет тегов.
zh_hans: 无标签。

# downloads.card.view_upstream
source: View on %@
ru: Открыть на %@
zh_hans: 在 %@ 上查看

# downloads.hf.mirror.placeholder
source: https://hf-mirror.com (empty = huggingface.co)
ru: https://hf-mirror.com (пусто = huggingface.co)
zh_hans: https://hf-mirror.com（空 = huggingface.co）

# downloads.hf.section.title
source: Add Model from Hugging Face
ru: Добавить модель из Hugging Face
zh_hans: 从 Hugging Face 添加模型

# downloads.mirror.configure
source: Configure mirror…
ru: Настроить зеркало…
zh_hans: 配置镜像…

# downloads.mirror.custom
source: custom
ru: пользовательский
zh_hans: 自定义

# downloads.mirror.label
source: Mirror:
ru: Зеркало:
zh_hans: 镜像：

# downloads.mirror.reset
source: Reset
ru: Сбросить
zh_hans: 重置

# downloads.ms.mirror.placeholder
source: https://modelscope.cn (empty = ModelScope default)
ru: https://modelscope.cn (пусто = ModelScope по умолчанию)
zh_hans: https://modelscope.cn（空 = ModelScope 默认值）

# downloads.ms.section.title
source: Add Model from ModelScope
ru: Добавить модель из ModelScope
zh_hans: 从 ModelScope 添加模型

# downloads.progress.bytes
source: %1$lld%% · %2$@ of %3$@
ru: %1$lld%% · %2$@ из %3$@
zh_hans: %1$lld%% · %2$@ / %3$@

# downloads.recent.subtitle
source: Recent: %lld
ru: Недавние: %lld
zh_hans: 最近：%lld

# downloads.recent.title
source: Recent Tasks
ru: Недавние задачи
zh_hans: 最近任务

# downloads.search.loading
source: Searching…
ru: Поиск…
zh_hans: 正在搜索…

# downloads.source.ms_unavailable
source: ModelScope SDK unavailable in this build
ru: ModelScope SDK недоступен в этой сборке
zh_hans: 此版本中 ModelScope SDK 不可用

# downloads.status.cancelled
source: Cancelled
ru: Отменено
zh_hans: 已取消

# downloads.status.completed
source: Completed
ru: Завершено
zh_hans: 已完成

# downloads.status.downloading
source: Downloading
ru: Скачивание
zh_hans: 正在下载

# downloads.status.failed
source: Failed
ru: Ошибка
zh_hans: 失败

# downloads.status.paused
source: Paused
ru: Пауза
zh_hans: 已暂停

# downloads.status.queued
source: Queued
ru: В очереди
zh_hans: 排队中

# downloads.suggested.empty
source: No suggestions available right now.
ru: Сейчас нет доступных рекомендаций.
zh_hans: 当前无可用建议。

# downloads.suggested.get
source: Get
ru: Скачать
zh_hans: 获取

# downloads.suggested.hint.filtered_by_ram
source: Filtered by free RAM
ru: Отфильтровано по свободной RAM
zh_hans: 按可用 RAM 筛选

# downloads.suggested.loading
source: Loading recommendations…
ru: Загрузка рекомендаций…
zh_hans: 正在加载推荐…

# downloads.suggested.sort.downloads
source: Most downloaded
ru: Самые скачиваемые
zh_hans: 下载量最多

# downloads.suggested.sort.params
source: Parameters: high to low
ru: Параметры: по убыванию
zh_hans: 参数量：从高到低

# downloads.suggested.sort.size
source: Size: high to low
ru: Размер: по убыванию
zh_hans: 大小：从高到低

# downloads.suggested.title
source: Suggested Models
ru: Рекомендуемые модели
zh_hans: 推荐模型

# integrations.claude.context_scaling
source: Context scaling
ru: Масштабирование контекста
zh_hans: 上下文缩放

# integrations.claude.context_scaling.sub
source: Stretch context windows for long agentic sessions
ru: Расширять контекстные окна для долгих агентных сессий
zh_hans: 为长时间代理会话扩展上下文窗口

# integrations.claude.haiku
source: Haiku tier
ru: Уровень Haiku
zh_hans: Haiku 级别

# integrations.claude.haiku.sub
source: Used for background tasks and tool calls
ru: Используется для фоновых задач и вызовов инструментов
zh_hans: 用于后台任务和工具调用

# integrations.claude.mode
source: Mode
ru: Режим
zh_hans: 模式

# integrations.claude.mode.cloud
source: Cloud
ru: Облако
zh_hans: 云端

# integrations.claude.mode.local
source: Local
ru: Локально
zh_hans: 本地

# integrations.claude.opus
source: Opus tier
ru: Уровень Opus
zh_hans: Opus 级别

# integrations.claude.sonnet
source: Sonnet tier
ru: Уровень Sonnet
zh_hans: Sonnet 级别

# integrations.claude.target_context
source: Target context size
ru: Целевой размер контекста
zh_hans: 目标上下文大小

# integrations.claude.target_context.sub
source: Per-request context window Claude Code will scale toward
ru: Контекстное окно, к которому Claude Code будет масштабировать каждый запрос
zh_hans: Claude Code 将缩放到的每次请求上下文窗口

# integrations.codex.app
source: Desktop App
ru: Десктоп-приложение
zh_hans: 桌面应用

# integrations.command.terminal_caption
source: $ Terminal
ru: $ Терминал
zh_hans: $ 终端

# integrations.error.target_context_invalid
source: Target context size must be a positive integer.
ru: Целевой размер контекста должен быть положительным целым числом.
zh_hans: 目标上下文大小必须是正整数。

# integrations.mcp.apply
source: Apply
ru: Применить
zh_hans: 应用

# integrations.mcp.config_path
source: Config Path
ru: Путь к конфигу
zh_hans: 配置路径

# integrations.mcp.config_path.sub
source: Absolute path to an MCP config JSON. Leave blank to disable.
ru: Абсолютный путь к JSON-конфигу MCP. Оставьте пустым, чтобы отключить.
zh_hans: MCP 配置 JSON 的绝对路径。留空则禁用。

# integrations.model.select_placeholder
source: Select model…
ru: Выберите модель…
zh_hans: 选择模型…

# integrations.openclaw.profile_label
source: Tools profile
ru: Профиль инструментов
zh_hans: 工具配置

# integrations.openclaw.profile_sub
source: Built-in MCP tools the OpenClaw launcher exposes
ru: Встроенные MCP-инструменты, которые публикует launcher OpenClaw
zh_hans: OpenClaw 启动器暴露的内置 MCP 工具

# integrations.openclaw.profile.coding
source: Coding
ru: Разработка
zh_hans: 编程

# integrations.openclaw.profile.full
source: Full
ru: Полный
zh_hans: 完整

# integrations.openclaw.profile.messaging
source: Messaging
ru: Сообщения
zh_hans: 消息

# integrations.openclaw.profile.minimal
source: Minimal
ru: Минимальный
zh_hans: 最小

# integrations.section.claude_code.sub
source: Route Claude Code requests to local models or the cloud
ru: Направлять запросы Claude Code в локальные модели или облако
zh_hans: 将 Claude Code 请求路由到本地模型或云端

# integrations.section.mcp.sub
source: Path to an MCP server config file. Shared across all integration launchers.
ru: Путь к файлу конфигурации MCP-сервера. Общий для всех launcher-интеграций.
zh_hans: MCP 服务器配置文件的路径。所有集成启动器共享。

# integrations.section.other
source: Other Integrations
ru: Другие интеграции
zh_hans: 其他集成

# integrations.section.other.sub
source: Default model + launcher command for each named integration
ru: Модель по умолчанию и команда запуска для каждой интеграции
zh_hans: 每个命名集成的默认模型 + 启动器命令

# integrations.section.setup_command
source: Setup Command
ru: Команда настройки
zh_hans: 设置命令

# integrations.setup.advanced.cloud
source: Resets Anthropic env vars so the real `claude` binary talks to the cloud.
ru: Сбрасывает переменные окружения Anthropic, чтобы настоящий бинарник `claude` обращался к облаку.
zh_hans: 重置 Anthropic 环境变量，使真正的 `claude` 二进制文件与云端通信。

# integrations.setup.advanced.label
source: Advanced — run `claude` directly
ru: Дополнительно — запускать `claude` напрямую
zh_hans: 高级 — 直接运行 `claude`

# integrations.setup.advanced.local
source: Points the real `claude` binary at your local oMLX server.
ru: Направляет настоящий бинарник `claude` на локальный сервер oMLX.
zh_hans: 将真正的 `claude` 二进制文件指向你的本地 oMLX 服务器。

# integrations.target_context.apply
source: Apply
ru: Применить
zh_hans: 应用

# logs.empty
source: No log entries.
ru: В логе нет записей.
zh_hans: 没有日志条目。

# logs.file.current
source: server.log (current)
ru: server.log (текущий)
zh_hans: server.log（当前）

# logs.lines.100
source: Last 100
ru: Последние 100
zh_hans: 最近 100 条

# logs.lines.500
source: Last 500
ru: Последние 500
zh_hans: 最近 500 条

# logs.lines.1000
source: Last 1,000
ru: Последние 1 000
zh_hans: 最近 1,000 条

# logs.lines.5000
source: Last 5,000
ru: Последние 5 000
zh_hans: 最近 5,000 条

# logs.lines.20000
source: Last 20,000
ru: Последние 20 000
zh_hans: 最近 20,000 条

# logs.row.file.label
source: Log file
ru: Файл лога
zh_hans: 日志文件

# logs.section.title
source: Server Logs
ru: Логи сервера
zh_hans: 服务器日志

# logs.subtitle.line_count
source: Lines: %lld
ru: Строк: %lld
zh_hans: 行数：%lld

# menubar.alert.dismiss
source: Dismiss
ru: Закрыть
zh_hans: 关闭

# menubar.alert.ok
source: OK
ru: ОК
zh_hans: 好

# menubar.alert.open_log
source: Open Log
ru: Открыть лог
zh_hans: 打开日志

# menubar.alert.open_settings
source: Open Settings
ru: Открыть настройки
zh_hans: 打开设置

# menubar.alert.pid_unknown
source: unknown PID
ru: неизвестный PID
zh_hans: 未知 PID

# menubar.alert.port_in_use.omlx
source: Another oMLX server is already running on this port (%@). Stop it before starting a new instance, or change the port in Settings.
ru: На этом порту (%@) уже запущен другой сервер oMLX. Остановите его перед запуском нового экземпляра или измените порт в настройках.
zh_hans: 另一个 oMLX 服务器已在该端口上运行（%@）。请先停止它再启动新实例，或在设置中更改端口。

# menubar.alert.port_in_use.other
source: Another process (%1$@) is listening on port %2$@. Choose a different port in Settings or terminate that process.
ru: Другой процесс (%1$@) слушает порт %2$@. Выберите другой порт в настройках или завершите этот процесс.
zh_hans: 另一个进程（%1$@）正在监听端口 %2$@。请在设置中选择其他端口或终止该进程。

# menubar.alert.port_in_use.title
source: Port %@ is in use.
ru: Порт %@ занят.
zh_hans: 端口 %@ 已被占用。

# menubar.alert.server_failed.access_hint
source: Check that the configured model directory is mounted and readable. If it is on an external or protected location, grant oMLX access in macOS Privacy & Security settings.
ru: Проверьте, что настроенный каталог моделей подключен и доступен для чтения. Если он находится на внешнем или защищенном диске, выдайте oMLX доступ в настройках macOS «Конфиденциальность и безопасность».
zh_hans: 请确认已配置的模型目录已挂载且可读。如果位于外部或受保护的位置，请在 macOS 隐私与安全性设置中授予 oMLX 访问权限。

# menubar.alert.server_failed.body
source: The server process exited before it became healthy.
ru: Процесс сервера завершился до того, как стал исправным.
zh_hans: 服务器进程在变为健康状态之前已退出。

# menubar.alert.server_failed.log_path
source: Log: %@
ru: Лог: %@
zh_hans: 日志：%@

# menubar.alert.server_failed.title
source: oMLX Server Failed to Start
ru: Не удалось запустить сервер oMLX
zh_hans: oMLX 服务器启动失败

# menubar.header.bootstrap_failed
source: Server: bootstrap failed (%@)
ru: Сервер: ошибка bootstrap (%@)
zh_hans: 服务器：引导失败（%@）

# menubar.header.failed
source: Server: failed — %@
ru: Сервер: ошибка — %@
zh_hans: 服务器：失败 — %@

# menubar.header.loading
source: Server: …
ru: Сервер: …
zh_hans: 服务器：…

# menubar.header.running
source: Server: running (port %@)
ru: Сервер: запущен (порт %@)
zh_hans: 服务器：运行中（端口 %@）

# menubar.header.starting
source: Server: starting…
ru: Сервер: запуск…
zh_hans: 服务器：正在启动…

# menubar.header.stopped
source: oMLX stopped
ru: oMLX остановлен
zh_hans: oMLX 已停止

# menubar.header.stopping
source: Server: stopping…
ru: Сервер: остановка…
zh_hans: 服务器：正在停止…

# menubar.header.unresponsive
source: Server: unresponsive (auto-recover or Force Restart)
ru: Сервер: не отвечает (автовосстановление или принудительный перезапуск)
zh_hans: 服务器：无响应（自动恢复或强制重启）

# menubar.item.about
source: About oMLX
ru: О приложении oMLX
zh_hans: 关于 oMLX

# menubar.item.chat
source: Chat with oMLX
ru: Чат с oMLX
zh_hans: 与 oMLX 聊天

# menubar.item.downloading_update
source: Downloading update… %lld%%
ru: Скачивание обновления… %lld%%
zh_hans: 正在下载更新… %lld%%

# menubar.item.force_restart
source: Force Restart
ru: Принудительно перезапустить
zh_hans: 强制重启

# menubar.item.install_update_version
source: Install oMLX %@…
ru: Установить oMLX %@…
zh_hans: 安装 oMLX %@…

# menubar.item.quit
source: Quit oMLX
ru: Выйти из oMLX
zh_hans: 退出 oMLX

# menubar.item.serving_stats
source: Serving Stats
ru: Статистика обслуживания
zh_hans: 服务统计

# menubar.item.settings
source: Settings…
ru: Настройки…
zh_hans: 设置…

# menubar.item.start_server
source: Start Server
ru: Запустить сервер
zh_hans: 启动服务器

# menubar.item.stop_server
source: Stop Server
ru: Остановить сервер
zh_hans: 停止服务器

# menubar.item.update_available
source: Install Update…
ru: Установить обновление…
zh_hans: 安装更新…

# menubar.item.web_dashboard
source: Open Web Dashboard
ru: Открыть веб-панель
zh_hans: 打开 Web 仪表盘

# menubar.stats.alltime_section
source: All-Time
ru: За все время
zh_hans: 累计

# menubar.stats.avg_pp_speed
source: Avg PP Speed
ru: Средняя скорость PP
zh_hans: 平均预填充速度

# menubar.stats.avg_tg_speed
source: Avg TG Speed
ru: Средняя скорость TG
zh_hans: 平均生成速度

# menubar.stats.cache_efficiency
source: Cache Efficiency
ru: Эффективность кэша
zh_hans: 缓存效率

# menubar.stats.cached_tokens
source: Cached Tokens
ru: Кэшированные токены
zh_hans: 已缓存 Token

# menubar.stats.loading
source: Loading stats…
ru: Загрузка статистики…
zh_hans: 正在加载统计…

# menubar.stats.live_activity
source: Live Activity
ru: Текущая активность
zh_hans: 实时活动

# menubar.stats.no_api_key
source: Set OMLX_API_KEY to enable stats
ru: Задайте OMLX_API_KEY, чтобы включить статистику
zh_hans: 设置 OMLX_API_KEY 以启用统计

# menubar.stats.server_off
source: Server is off
ru: Сервер выключен
zh_hans: 服务器已关闭

# menubar.stats.session_section
source: Session
ru: Сессия
zh_hans: 会话

# menubar.stats.total_requests
source: Total Requests
ru: Всего запросов
zh_hans: 总请求数

# menubar.stats.total_tokens
source: Total Tokens Processed
ru: Всего обработано токенов
zh_hans: 已处理 Token 总数

# metrics.thermal.critical
source: Critical
ru: Критическое
zh_hans: 危急

# metrics.thermal.fair
source: Fair
ru: Среднее
zh_hans: 一般

# metrics.thermal.nominal
source: Nominal
ru: Нормальное
zh_hans: 正常

# metrics.thermal.serious
source: Serious
ru: Серьезное
zh_hans: 严重

# models.active.badge.idle
source: Idle
ru: Простой
zh_hans: 空闲

# models.active.badge.loaded
source: Loaded
ru: Загружено
zh_hans: 已加载

# models.active.empty
source: No models loaded
ru: Нет загруженных моделей
zh_hans: 尚未加载模型

# models.active.subtitle
source: %1$lld loaded · %2$@
ru: %1$lld загружено · %2$@
zh_hans: %1$lld 个已加载 · %2$@

# models.active.title
source: Active Models
ru: Активные модели
zh_hans: 活跃模型

# models.active.unload.help
source: Unload model
ru: Выгрузить модель
zh_hans: 卸载模型

# models.delete.confirm_button
source: Delete %@
ru: Удалить %@
zh_hans: 删除 %@

# models.delete.confirm_message
source: The model files will be permanently removed from disk and unloaded if currently running.
ru: Файлы модели будут безвозвратно удалены с диска и выгружены, если модель сейчас запущена.
zh_hans: 模型文件将从磁盘永久删除，如果当前正在运行则会被卸载。

# models.delete.confirm_title
source: Delete this model from disk?
ru: Удалить эту модель с диска?
zh_hans: 从磁盘删除此模型？

# models.library.empty.sub
source: Use the Downloads screen to fetch a model from Hugging Face.
ru: Откройте экран загрузок, чтобы скачать модель из Hugging Face.
zh_hans: 使用下载页面从 Hugging Face 获取模型。

# models.library.empty.title
source: No models discovered
ru: Модели не найдены
zh_hans: 未发现模型

# models.library.load
source: Load
ru: Загрузить
zh_hans: 加载

# models.library.remove.help
source: Remove from disk
ru: Удалить с диска
zh_hans: 从磁盘删除

# models.library.settings.help
source: Settings
ru: Настройки
zh_hans: 设置

# models.library.subtitle
source: Models: %1$lld · %2$@ on disk
ru: Моделей: %1$lld · %2$@ на диске
zh_hans: 模型：%1$lld · 磁盘占用 %2$@

# models.library.title
source: Model Library
ru: Библиотека моделей
zh_hans: 模型库

# models.library.unload
source: Unload
ru: Выгрузить
zh_hans: 卸载

# network.button.apply
source: Apply
ru: Применить
zh_hans: 应用

# network.row.ca_bundle.label
source: CA bundle
ru: Набор CA-сертификатов
zh_hans: CA 证书包

# network.row.ca_bundle.sub
source: Absolute path to a PEM-encoded CA bundle. Empty = system trust store.
ru: Абсолютный путь к набору CA-сертификатов в формате PEM. Пусто = системное хранилище доверия.
zh_hans: PEM 编码的 CA 证书包的绝对路径。为空则使用系统信任存储。

# network.row.http_proxy.label
source: HTTP proxy
ru: HTTP-прокси
zh_hans: HTTP 代理

# network.row.https_proxy.label
source: HTTPS proxy
ru: HTTPS-прокси
zh_hans: HTTPS 代理

# network.row.no_proxy.label
source: No proxy
ru: Без прокси
zh_hans: 不使用代理

# network.row.no_proxy.sub
source: Comma-separated host/CIDR list to bypass the proxy.
ru: Список host/CIDR через запятую, для которых прокси обходится.
zh_hans: 逗号分隔的主机/CIDR 列表，绕过代理。

# network.section.proxies.subtitle
source: Outbound HTTP routing. Empty = no proxy. Applied via HTTP_PROXY / HTTPS_PROXY / NO_PROXY env vars.
ru: Исходящая HTTP-маршрутизация. Пусто = без прокси. Применяется через переменные окружения HTTP_PROXY / HTTPS_PROXY / NO_PROXY.
zh_hans: 出站 HTTP 路由。为空则不使用代理。通过 HTTP_PROXY / HTTPS_PROXY / NO_PROXY 环境变量应用。

# network.section.proxies.title
source: Proxies
ru: Прокси
zh_hans: 代理
